## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_pet.stac will be created
  + resource "random_pet" "stac" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "gmstac"
        # (1 unchanged attribute hidden)
    }

  # module.azure_ai_multi_service.azurerm_cognitive_account.ai_account will be created
  + resource "azurerm_cognitive_account" "ai_account" {
      + custom_subdomain_name              = "gmaimsliveskylark"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "CognitiveServices"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = "gmaimsliveskylark"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-hot-hornet"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.azure_ai_multi_service.azurerm_cognitive_account.aoai_account will be destroyed
  # (because azurerm_cognitive_account.aoai_account is not in configuration)
  - resource "azurerm_cognitive_account" "aoai_account" {
      - custom_subdomain_name                       = "gmaimsliveskylark" -> null
      - dynamic_throttling_enabled                  = false -> null
      - endpoint                                    = "https://gmaimsliveskylark.cognitiveservices.azure.com/" -> null
      - id                                          = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmaimsliveskylark" -> null
      - kind                                        = "CognitiveServices" -> null
      - local_auth_enabled                          = true -> null
      - location                                    = "eastus2" -> null
      - name                                        = "gmaimsliveskylark" -> null
      - outbound_network_access_restricted          = false -> null
      - primary_access_key                          = (sensitive value) -> null
      - public_network_access_enabled               = true -> null
      - resource_group_name                         = "rg-hot-hornet" -> null
      - secondary_access_key                        = (sensitive value) -> null
      - sku_name                                    = "S0" -> null
        # (6 unchanged attributes hidden)
    }

  # module.azure_cognitive_account.azurerm_cognitive_account.ai_account will be created
  + resource "azurerm_cognitive_account" "ai_account" {
      + custom_subdomain_name              = "gmcoacequalstingray"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = "gmcoacequalstingray"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-hot-hornet"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.azure_cognitive_account.azurerm_cognitive_account.aoai_account will be destroyed
  # (because azurerm_cognitive_account.aoai_account is not in configuration)
  - resource "azurerm_cognitive_account" "aoai_account" {
      - custom_subdomain_name                       = "gmcoacequalstingray" -> null
      - dynamic_throttling_enabled                  = false -> null
      - endpoint                                    = "https://gmcoacequalstingray.openai.azure.com/" -> null
      - fqdns                                       = [] -> null
      - id                                          = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray" -> null
      - kind                                        = "OpenAI" -> null
      - local_auth_enabled                          = true -> null
      - location                                    = "eastus2" -> null
      - name                                        = "gmcoacequalstingray" -> null
      - outbound_network_access_restricted          = false -> null
      - primary_access_key                          = (sensitive value) -> null
      - public_network_access_enabled               = true -> null
      - resource_group_name                         = "rg-hot-hornet" -> null
      - secondary_access_key                        = (sensitive value) -> null
      - sku_name                                    = "S0" -> null
      - tags                                        = {} -> null
        # (6 unchanged attributes hidden)
    }

  # module.azure_openai_deployment_embedding.azurerm_cognitive_deployment.aoai_deployment must be replaced
-/+ resource "azurerm_cognitive_deployment" "aoai_deployment" {
      ~ cognitive_account_id       = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray" -> (known after apply) # forces replacement
      - dynamic_throttling_enabled = false -> null
      ~ id                         = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray/deployments/text-embedding-3-small" -> (known after apply)
        name                       = "text-embedding-3-small"
        # (2 unchanged attributes hidden)

      ~ model {
            name    = "text-embedding-3-small"
          - version = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.azure_openai_deployment_gpt.azurerm_cognitive_deployment.aoai_deployment must be replaced
-/+ resource "azurerm_cognitive_deployment" "aoai_deployment" {
      ~ cognitive_account_id       = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray" -> (known after apply) # forces replacement
      - dynamic_throttling_enabled = false -> null
      ~ id                         = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray/deployments/gpt-4o-mini" -> (known after apply)
        name                       = "gpt-4o-mini"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.azure_storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "BlobStorage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus2"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-hot-hornet"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.stac_container_rag.azurerm_storage_container.container will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "rag"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

Plan: 7 to add, 0 to change, 4 to destroy.
```
</details>